#!/usr/bin/env python
# encoding: utf-8

text = u"""

基隆端,基隆,八堵,大華系統,五堵,汐止,汐止系統,東湖,內湖,圓山,台北,三重,五股,高公局,林口(文化一路),林口(文化北路),桃園,機場系統,中壢服務區,內壢,中壢,平鎮系統,幼獅,楊梅,楊梅聯絡道,湖口,竹北,新竹(新竹、竹東),新竹(科學工業園區),新竹系統,頭份,頭屋,苗栗,銅鑼,三義,后里,台中系統,豐原,大雅,台中,南屯,王田,彰化系統,彰化,埔鹽系統,員林,北斗,西螺,虎尾,斗南,雲林系統,大林,民雄,嘉義,水上,嘉義系統,新營,下營系統,麻豆,安定,台南系統,永康,台南,仁德系統,路竹,高科,岡山,楠梓(北上入口),楠梓(南下入口),鼎金系統,高雄(九如路、建國路),高雄(中正路、三多路),瑞隆路,五甲系統,五甲,高雄端

機場端,大園,大竹,機場系統,南桃園,大湳,鶯歌系統

基金,瑪東系統,汐止系統,新台五路,南港,南港系統,南深路,木柵,新店,安坑,中和,土城,三鶯,鶯歌系統,大溪,龍潭,關西服務區,關西,竹林,寶山,新竹系統,茄苳,香山,西濱,竹南,大山,後龍,通霄,苑裡,大甲,中港系統,清水服務區,沙鹿,龍井,和美,彰化系統,快官,烏日,中投,霧峰,霧峰系統,草屯,中興系統,中興,南投,南投服務區,名間,竹山,斗六,古坑系統,古坑服務區,梅山,竹崎(北上入口),竹崎(南下入口),中埔,水上系統,白河,東山服務區,烏山頭,官田系統,善化,新化系統,關廟,田寮,燕巢系統,九如,長治,麟洛,竹田系統,崁頂,南州,林邊,大鵬灣端

清水端,中港系統,神岡,台中系統,后豐,豐原端

南港系統,石碇,坪林專用道,頭城,宜蘭(北),宜蘭(南),羅東,蘇澳

霧峰系統,舊正,東草屯,國姓,北山,愛蘭,埔里,埔里端

台南端,新吉,台南系統,新市,新化系統,新化端

左營端,鼎金系統,仁武(水管路),燕巢,燕巢系統,嶺口,旗山端

汐止系統,堤頂,下塔悠出口,環北,五股,泰山轉接道,機場系統,中壢,楊梅
深坑端,木柵,萬芳,台北端

"""


out = ""

lines = text.split("\n")
for line in lines:
	nodes = line.split(",")
	print nodes
	if len(nodes):
		for i in range(1, len(nodes)):
			out += "%s,%s,1\n" % (nodes[i - 1], nodes[i])

with open("test.txt", "w") as f:
	f.write(out.encode("utf-8"))